import os
import time
import animation as A
import sys

number = [
r"""
  ██
 ███
  ██
  ██
  ██
 █████
""",
r"""
 █████
██   ██
    ██
   ██
  ██
 ███████
""",
r"""
 █████
██   ██
    ██
  ███
██   ██
 █████
"""
    ]

p = (r"""
██████╗ ██╗      █████╗ ██╗   ██╗███████╗██████╗ 
██╔══██╗██║     ██╔══██╗╚██╗ ██╔╝██╔════╝██╔══██╗
██████╔╝██║     ███████║ ╚████╔╝ █████╗  ██████╔╝
██╔═══╝ ██║     ██╔══██║  ╚██╔╝  ██╔══╝  ██╔══██╗
██║     ███████╗██║  ██║   ██║   ███████╗██║  ██║
╚═╝     ╚══════╝╚═╝  ╚═╝   ╚═╝   ╚══════╝╚═╝  ╚═╝
""")

e = (r"""
███████╗███╗   ██╗███████╗███╗   ███╗██╗   ██╗
██╔════╝████╗  ██║██╔════╝████╗ ████║╚██╗ ██╔╝
█████╗  ██╔██╗ ██║█████╗  ██╔████╔██║ ╚████╔╝ 
██╔══╝  ██║╚██╗██║██╔══╝  ██║╚██╔╝██║  ╚██╔╝  
███████╗██║ ╚████║███████╗██║ ╚═╝ ██║   ██║   
╚══════╝╚═╝  ╚═══╝╚══════╝╚═╝     ╚═╝   ╚═╝   
""")

vs = (r"""
██╗   ██╗███████╗
██║   ██║██╔════╝
██║   ██║███████╗
██║   ██║╚════██║
██████╔╝███████║
╚═════╝ ╚══════╝
""")

start = "GET INTO GEAR, READY?"

def Entry():
    entry = r"""
🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥
🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥
🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥
🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥
🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥
🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥
🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥
🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥
🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥
🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥
🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥
🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥🔥 LIEf GAME 🔥🔥🔥
"""


    for i in range(16):          
        os.system("clear")
        print("\n" * i + entry)
        time.sleep(0.08)

    for i in range(16, -1, -1): 
        os.system("clear")
        print("\n" * i + entry)
        time.sleep(0.08)



def intro():
    A.clear()
    A.animate((p),speed=0.01)
    A.clear(speed=0.01)
    A.animate((vs),speed=0.01)
    A.clear(speed=0.01)
    A.animate((e),speed=0.01)
    A.clear(speed=0.50)
    Entry()
    A.clear(speed=0.10)
    for i in number:
        A.clear(speed=0.60)
        print(i)
        flush = True
        time.sleep(0.01)
    A.clear(speed=1)
    A.animate(start)
    A.backstep(start)
def sword_player():

    frames = [

r"""
 O            O
/|\          /|\
 |            |
/ \          / \
""",

r"""
 O            O
/|-          /|\
 |            |
/ \          / \
""",

r"""
 O            O
/|=>         /|\
 |            |
/ \          / \
""",

r"""
 O            O
/|===>       /|\
 |            |
/ \          / \
""",

r"""
 O            O
/|==========>/|\
 |            |
/ \          / \
""",

r"""
 O            O
/|=>         /|\
 |            |
/ \          / \
""",

r"""
 O            O
/|-          /|\
 |            |
/ \          / \
""",

r"""
 O            O
/|\          /|\
 |            |
/ \          / \
""",
    ]
    for frame in frames:
        A.clear(speed=0.40)
        print(frame)
        flush = True
        
    
def sword_enemy():
    frame = [

r"""
 O            O
/|\          /|\
 |            |
/ \          / \
""",

r"""
 O            O
/|\          -|\
 |            |
/ \          / \
""",

r"""
 O            O
/|\         <=|\
 |            |
/ \          / \
""",

r"""
 O            O
/|\     <=====|\
 |            |
/ \          / \
""",

r"""
 O            O
/|\ <=========|\
 |            |
/ \          / \
""",

r"""
 O            O
/|\         <=|\
 |            |
/ \          / \
""",

r"""
 O            O
/|\          -|\
 |            |
/ \          / \
""",

r"""
 O            O
/|\          /|\
 |            |
/ \          / \
""",
    ]
    

    
    for f in frame:
        A.clear(speed=0.40)
        print(f)
        flush = True
        

    
def heal_animation():
    healing = [
        r"""
            ✚
        """,
        r"""
          ✚ ✚ ✚
        """,
        r"""
        ✚ ✚ ✚ ✚ ✚
        """,
        r"""
          ✚ ✚ ✚
        """,
    ]
    
    for h in healing:
        A.clear(speed=0.40)
        print(h)
        flush = True
